[
    {
        "标题"    :   "我为什么做这个软件？",
        "内容"    :   "为了生存，没错，你没看错，是生存，不是生活\n可能你会好奇，为什么我是说为了生存而不是生活，因为生活这个词对我来说太遥远了。为什么？这是一个很久很久以前的故事。如果你感兴趣的话，滚动到最后面便可以知晓，因为文字太长了，就不放在最前面了。"
    },
    {
        "标题"    :"关于赞助的问题",
        "内容"    :"我每个月会大概会提示 1 次赞助信息，您愿意赞助就赞助，不愿意的话，关掉提示信息即可，我不会强迫任何人进行赞助，毕竟赞助是自愿的行为，但如果没有人赞助的话，软件是很难维持下去的。"
    },
    {
        "标题"    :"为什么不收费？",
        "内容"    :"关于为什么不收费，可以阅读下方的 '我为什么做这个软件'，到目前为止，我都是在按照当初的想法在做。也算是了了当初的'心愿'。能按照当初的想法一直走下去，那就一直都不会收费。而且，我初二就辍学了，没有学到什么知识，如果软件能帮助那些需要学习的人，那对我来说，也挺欣慰的。"
    },
    {
        "标题"    :"软件后续的功能",
        "内容"    :"目前而言，仅仅只有背英语单词的功能，后续我会添加背诵其他语言单词的功能。词库的话，当前版本只有内置的词库，就是解释不完整，也没有例句。当前你可以用在线词典显示单词的释义，就目前而已我也推荐使用在线的词典。后续我会增加使用外挂词典的功能，就是你可以自行下载常用的词典进行单词释义的显示。比如dsl,ld2 等词典格式。伴随而来的还有多语言的单词背诵功能。当然还有其他的很多功能，后续我会慢慢的增加。"
    },
    {
        "标题"    :"觉得软件很不错？",
        "内容"    :"如果你觉得软件很不错的话，那就帮我推荐推荐吧，谢谢咯"
    },
    {
        "标题"    :   "遇到困难？",
        "内容"    :   "遇到任何困难请及时通过上方的联系方式联系我，或者可以先在B站看一下有没有相关问题的解答。很多和软件有关的问题我都会录制成视频上传到B站的\n当然，如果你能关注一下我的话，那当然就更好了"
    },
    {
        "标题"    :   "更多帮助？",
        "内容"    :   "有任何意见或建议您都可以通过上方的联系方式联系我，如果软件发生 BUG ，请务必与我联系，因为以我目前的情况，我无法做到在任何设备上都能完美的运行，还希望您能理解"
    },
    {
        "标题"    :   "关于数据同步的问题",
        "内容"    :   "其他情况我已经在'我为什么做这个软件中说了'，鉴于目前的情况而言，我实在没有资金去租用服务器来维持数据同步等功能，后续看情况吧，如果能通过赞助获取到收入，我会开通数据同步等需要服务器才能使用的相关功能\n在当前的这个版本，你可以直接手动备份 /sdcard/Android/data/forest.galanthusnivalis.dustfree/files 目录下的所有文件，软件数据全部都是用明文保存的，所以你可以将备份的数据传给任一一个手机进行使用。如果你只是想备份记忆数据的话，那直接复制 /sdcard/Android/data/forest.galanthusnivalis.dustfree/files/记忆/记忆.json 这个文件就可以了。你所有的记忆数据都是保存在这个文件中的。"
    },
    {
        "标题"    :   "没有服务器，通知信息从何而来？",
        "内容"    :   "通知，帮助，联系方式等需要通过服务器获取的信息是保存在码云(www.gitee.com)我的个人仓库里面的静态 json 文件\n您可以通过 http://theguitu.gitee.io/forest/ 这个网址来访问我在 gitee 上的个人博客( 当然，目前你打开只能看到 404 )"
    },
    {
        "标题"    :   "为什么这个页面不是设置界面？",
        "内容"    :   "你可能会问，为什么别人软件的更多或个人界面都是软件设置的入口，而我这里居然连一个设置按钮都没有，原因嘛，因为我不知道有什么需要设置的啊，所以就没有咯\n复习，学习，等相关设置都可以在学习界面中设置。我的想法是，哪里需要用到这个设置就在哪里设置，因为那样可以随时切换设置。要不然你在学习的时候为了切换成随机单词还要退出学习状态返回到这里来设置再回去学习嘛，那样多麻烦啊"
    },
    {
        "标题"    :   "为什么说是为了生存？",
        "内容"    : "且听我慢慢道来：16岁(2008年，我初二辍学了)的时候，在一家私人机械加工厂上班，那年恰好时值七月，暑热难耐，直叫人昏昏欲睡。卡，其实没这么夸张，就是老板家的冲床失灵，在我伸手去捡铁板的时候，冲床失灵砸了下来，把我左手砸碎了，不幸中的万幸，还剩下拇指和一半截食指，让我现在能端碗吃饭。其实如果仅仅只是左手受伤(我到现在都不愿意说残疾这个词)的话，对我影响也不是太大。可是的可是，屋漏偏逢连夜雨，船迟又遇打头风，我颈椎坏了，严重的颈椎病，严重的脑供血不足。到现在任然没有去医治。为什么？没有钱呗。时间太久，以后能不能治好，已经成了一个未知数。世人都常说，上帝给你关上一扇门的时候一定会给你打开一扇窗。但对于我来说，上帝不仅把我的门给关了，还把我的窗给焊死了，让我无路可走，体力与脑力我都很难做。在这种极度绝望的情况下，我想到了开个网店，但你知道的，没资金没人流开网店不就是死吗？我当然也知道，所以当时的想法就是做软件，靠软件积累人流，卖东西。我也不知道能不能有用，所以中途放弃了很多次，但总算坚持了下来。坚持，不一定有收获，但不坚持，一定是看不到结果的。这个软件是从头一边学习一边做的，在此过程中，由于颈椎，头痛的折磨，几度放弃，但庆幸坚持了下来。由于颈椎，头痛的原因，所以我学的很慢，做的也很慢，从开始到现在，有2年时间了吧。三天打鱼两天晒网，断断续续的就这么坚持了下来。所以，我做的这一切都是为了生存，不是为了生活\n我坚信，要想得到什么，必先付出什么\n我始终相信，我帮助到了别人，就一定能从别人那里获取到回报\n所以，如果软件对你有帮助，还望你赞助一下，或者，可以到我店铺里买点东西(虽然现在还没有店铺，以后会有的)\n您也可以通过上方的各种联系方式联系我，或建议，或交流，或赞助，来者，皆是朋友，不拒"
    }
]